;; system
(package! agenix)

;; ai
(package! gpt-commit)
(package! gptel)
(package! tabnine)

;; agenda
(package! org-super-agenda)

;; code
(package! mips-mode)
(package! go-mode)
;; (package! deno-fmt)
(package! plantuml-mode)

;; fun
(package! gameoflife)
;; (package! sudoku)
