;; system
(package! agenix)

;; ai
(package! gpt-commit)
(package! gptel)
(package! tabnine)

;; org
(package! org-super-agenda)
(package! org-static-blog)

;; noter
(package! djvu)
(package! nov)

;; code
(package! mips-mode)
(package! go-mode)
;; (package! deno-fmt)
(package! plantuml-mode)

;; ;; themes
;; (package! nova-theme)
;; (package! abyss-theme)
;; (package! afternoon-theme)
;; ;; (package! alect-theme)
;; (package! ample-theme)
;; (package! abyss-theme)
;; (package! acme-theme)
;; (package! adwaita-dark-theme)
;; (package! afternoon-theme)
;; (package! ahungry-theme)
;; (package! aircon-theme)
;; ;; (package! airline-themes)
;; ;; (package! alect-themes)
;; ;; (package! almost-mono-themes)
;; (package! ample-theme)
;; (package! ample-zen-theme)
;; (package! ancient-one-dark-theme)
;; (package! anti-zenburn-theme)
;; ;; (package! app-monochrome-themes)
;; (package! apropospriate-theme)
;; (package! arjen-grey-theme)
;; (package! atom-dark-theme)
;; (package! atom-one-dark-theme)
;; (package! auto-dark)
;; (package! autothemer)
;; (package! autumn-light-theme)
;; ;; (package! avk-emacs-themes)
;; (package! ayu-theme)
;; (package! badger-theme)
;; (package! badwolf-theme)
;; (package! base16-theme)
;; (package! basic-theme)
;; (package! berrys-theme)
;; ;; (package! birds-of-paradise-plus-)
;; (package! blackboard-theme)
;; (package! bliss-theme)
;; (package! borland-blue-theme)
;; (package! boron-theme)
;; (package! brutalist-theme)
;; (package! bubbleberry-theme)
;; (package! busybee-theme)
;; (package! calmer-forest-theme)
;; (package! caroline-theme)
;; (package! catppuccin-theme)
;; (package! challenger-deep-theme)
;; (package! cherry-blossom-theme)
;; (package! chocolate-theme)
;; (package! chyla-dark-theme)
;; (package! chyla-theme)
;; (package! circadian)
;; (package! cloud-theme)
;; (package! clues-theme)
;; (package! codex-theme)
;; (package! colonoscopy-theme)
;; (package! color-theme)
;; (package! color-theme-approximate)
;; ;; (package! color-theme-buffer-loca)
;; (package! color-theme-modern)
;; ;; (package! color-theme-sanityinc-s)
;; ;; (package! color-theme-sanityinc-t)
;; (package! color-theme-x)
;; ;; (package! colorless-themes)
;; (package! commentary-theme)
;; (package! constant-theme)
;; (package! creamsody-theme)
;; (package! curry-on-theme)
;; (package! cyanometric-theme)
;; (package! cybercafe-theme)
;; (package! cyberpunk-2019-theme)
;; (package! cyberpunk-theme)
;; ;; (package! cycle-themes)
;; (package! dakrone-light-theme)
;; (package! dakrone-theme)
;; (package! danneskjold-theme)
;; (package! darcula-theme)
;; (package! dark-krystal-theme)
;; (package! dark-mint-theme)
;; (package! darkmine-theme)
;; (package! darkokai-theme)
;; (package! darktooth-theme)
;; ;; (package! dir-treeview-themes)
;; (package! display-theme)
;; (package! distinguished-theme)
;; (package! django-theme)
;; ;; (package! doom-themes)
;; (package! dracula-theme)
;; (package! dream-theme)
;; (package! eclipse-theme)
;; ;; (package! ef-themes)
;; (package! eink-theme)
;; (package! elune-theme)
;; (package! enlightened-theme)
;; (package! esmond-theme)
;; (package! espresso-theme)
;; (package! evangelion-theme)
;; (package! evenok)
;; (package! ewal)
;; ;; (package! ewal-doom-themes)
;; ;; (package! ewal-spacemacs-themes)
;; (package! exotica-theme)
;; ;; (package! eziam-themes)
;; (package! faff-theme)
;; (package! fantom-theme)
;; ;; (package! farmhouse-themes)
;; (package! firecode-theme)
;; (package! flatfluc-theme)
;; (package! flatland-black-theme)
;; (package! flatland-theme)
;; (package! flatui-dark-theme)
;; (package! flatui-theme)
;; (package! fleetish-theme)
;; ;; (package! flexoki-themes)
;; ;; (package! flucui-themes)
;; (package! foggy-night-theme)
;; (package! forest-blue-theme)
;; (package! gandalf-theme)
;; (package! girly-notebook-theme)
;; ;; (package! github-dark-vscode-them)
;; (package! glass-tty-theme)
;; (package! goose-theme)
;; (package! grandshell-theme)
;; (package! graphene-meta-theme)
;; (package! grayscale-theme)
;; ;; (package! green-is-the-new-black-)
;; (package! green-phosphor-theme)
;; (package! green-screen-theme)
;; (package! grey-paper-theme)
;; (package! greymatters-theme)
;; (package! gruber-darker-theme)
;; (package! gruber-darker-theme)
;; (package! gruvbox-theme)
;; (package! gruvbox-theme)
;; (package! gtk-variant)
;; (package! habamax-theme)
;; (package! haki-theme)
;; (package! halloweenie-theme)
;; (package! hamburg-theme)
;; (package! hc-zenburn-theme)
;; (package! heaven-and-hell)
;; (package! helix-theme)
;; ;; (package! helm-themes)
;; (package! hemera-theme)
;; (package! hemisu-theme)
;; (package! heroku-theme)
;; (package! hima-theme)
;; ;; (package! hippo-themes)
;; (package! horizon-theme)
;; ;; (package! humanoid-themes)
;; (package! hybrid-reverse-theme)
;; (package! hydandata-light-theme)
;; ;; (package! hyperstitional-themes)
;; (package! iceberg-theme)
;; (package! idea-darkula-theme)
;; (package! immaterial-theme)
;; (package! inkpot-theme)
;; (package! inkpot-theme)
;; (package! intellij-theme)
;; (package! inverse-acme-theme)
;; (package! iodine-theme)
;; (package! iosevka-theme)
;; (package! ir-black-theme)
;; (package! jazz-theme)
;; (package! jbeans-theme)
;; (package! jetbrains-darcula-theme)
;; ;; (package! kanagawa-themes)
;; ;; (package! kaolin-themes)
;; (package! klere-theme)
;; (package! kooten-theme)
;; (package! kosmos-theme)
;; (package! kuronami-theme)
;; ;; (package! lab-themes)
;; (package! labburn-theme)
;; (package! lacquer)
;; (package! laguna-theme)
;; (package! lavender-theme)
;; (package! lavenderless-theme)
;; (package! leuven-theme)
;; (package! light-soap-theme)
;; (package! liso-theme)
;; (package! load-theme-buffer-local)
;; (package! lush-theme)
;; (package! madhat2r-theme)
;; ;; (package! majapahit-themes)
;; (package! mandm-theme)
;; (package! material-theme)
;; (package! mbo70s-theme)
;; (package! melancholy-theme)
;; (package! mellow-theme)
;; (package! metalheart-theme)
;; (package! mindre-theme)
;; (package! minimal-theme)
;; (package! minsk-theme)
;; (package! modus-themes)
;; ;; (package! moe-theme)
;; (package! moe-theme)
;; (package! molokai-theme)
;; (package! monochrome-theme)
;; (package! monokai-alt-theme)
;; (package! monokai-pro-theme)
;; (package! monokai-theme)
;; (package! monotropic-theme)
;; (package! mood-one-theme)
;; (package! morgentau-theme)
;; (package! morrowind-theme)
;; (package! mustang-theme)
;; (package! mustard-theme)
;; ;; (package! naga-theme)
;; (package! nano-theme)
;; (package! naquadah-theme)
;; (package! naysayer-theme)
;; (package! nezburn-theme)
;; (package! night-owl-theme)
;; (package! nimbus-theme)
;; ;; (package! no-clown-fiesta-theme)
;; (package! noctilux-theme)
;; (package! nofrils-acme-theme)
;; (package! nord-theme)
;; (package! nordic-night-theme)
;; (package! nordless-theme)
;; (package! northcode-theme)
;; (package! nothing-theme)
;; (package! notink-theme)
;; (package! nova-theme)
;; (package! ns-auto-titlebar)
;; (package! nubox)
;; (package! nyx-theme)
;; (package! oblivion-theme)
;; (package! oblivion-theme)
;; (package! obsidian-theme)
;; (package! occidental-theme)
;; (package! oceanic-theme)
;; (package! oldlace-theme)
;; ;; (package! omtose-phellack-themes)
;; ;; (package! one-themes)
;; (package! orangey-bits-theme)
;; (package! org-beautify-theme)
;; (package! organic-green-theme)
;; (package! overcast-theme)
;; (package! paganini-theme)
;; (package! panda-theme)
;; (package! paper-theme)
;; (package! parchment-theme)
;; (package! pastelmac-theme)
;; (package! peacock-theme)
;; (package! per-buffer-theme)
;; (package! phoenix-dark-mono-theme)
;; (package! phoenix-dark-pink-theme)
;; (package! plain-theme)
;; (package! plan9-theme)
;; (package! planet-theme)
;; (package! poet-theme)
;; (package! prassee-theme)
;; (package! professional-theme)
;; (package! pumpkin-spice-theme)
;; ;; (package! punpun-themes)
;; (package! purp-theme)
;; (package! purple-haze-theme)
;; (package! qtcreator-theme)
;; (package! quasi-monochrome-theme)
;; ;; (package! railscasts-reloaded-the)
;; (package! railscasts-theme)
;; (package! rand-theme)
;; (package! rebecca-theme)
;; (package! remember-last-theme)
;; (package! reverse-theme)
;; (package! reykjavik-theme)
;; (package! rimero-theme)
;; (package! sakura-theme)
;; ;; (package! sculpture-themes)
;; ;; (package! select-themes)
;; (package! seoul256-theme)
;; (package! seti-theme)
;; (package! sexy-monochrome-theme)
;; (package! shades-of-purple-theme)
;; ;; (package! shanty-themes)
;; (package! silkworm-theme)
;; (package! simplicity-theme)
;; ;; (package! sketch-themes)
;; (package! slime-theme)
;; ;; (package! smart-mode-line-atom-on)
;; ;; (package! smart-mode-line-powerli)
;; (package! smyx-theme)
;; (package! snazzy-theme)
;; (package! soft-charcoal-theme)
;; (package! soft-morning-theme)
;; (package! soft-stone-theme)
;; (package! solarized-theme)
;; (package! solo-jazz-theme)
;; (package! soothe-theme)
;; (package! sorcery-theme)
;; (package! soria-theme)
;; (package! sourcerer-theme)
;; (package! space-theming)
;; (package! spacegray-theme)
;; (package! spaceline-all-the-icons)
;; (package! spacemacs-theme)
;; (package! srcery-theme)
;; ;; (package! standard-themes)
;; (package! starlit-theme)
;; ;; (package! stimmung-themes)
;; (package! subatomic-theme)
;; (package! subatomic256-theme)
;; ;; (package! sublime-themes)
;; (package! sunburn-theme)
;; (package! sunny-day-theme)
;; (package! suscolors-theme)
;; ;; (package! svg-mode-line-themes)
;; (package! sweet-theme)
;; (package! tango-2-theme)
;; (package! tango-plus-theme)
;; (package! tangonov-theme)
;; (package! tangotango-theme)
;; (package! tao-theme)
;; (package! tardis-theme)
;; (package! termbright-theme)
;; (package! the-matrix-theme)
;; (package! theme-anchor)
;; (package! theme-buffet)
;; (package! theme-changer)
;; (package! theme-looper)
;; (package! theme-magic)
;; (package! timu-caribbean-theme)
;; (package! timu-macos-theme)
;; (package! timu-rouge-theme)
;; (package! timu-spacegrey-theme)
;; (package! tok-theme)
;; (package! tommyh-theme)
;; ;; (package! tomorrow-night-deepblue)
;; (package! toxi-theme)
;; (package! tramp-theme)
;; (package! treemacs-nerd-icons)
;; (package! tron-legacy-theme)
;; ;; (package! twilight-anti-bright-th)
;; (package! twilight-bright-theme)
;; (package! twilight-theme)
;; (package! ubuntu-theme)
;; (package! ujelly-theme)
;; (package! undersea-theme)
;; (package! underwater-theme)
;; (package! unobtrusive-magit-theme)
;; (package! unspecified-theme)
;; (package! uwu-theme)
;; (package! vampyricdark-theme)
;; (package! vegetative-theme)
;; (package! vs-dark-theme)
;; (package! vs-light-theme)
;; (package! vscdark-theme)
;; (package! vscode-dark-plus-theme)
;; (package! waher-theme)
;; (package! warm-night-theme)
;; (package! weyland-yutani-theme)
;; (package! white-sand-theme)
;; (package! white-theme)
;; (package! wildcharm-light-theme)
;; (package! wildcharm-theme)
;; (package! xresources-theme)
;; (package! yabaki-theme)
;; (package! yoshi-theme)
;; (package! zen-and-art-theme)
;; (package! zenburn-theme)
;; (package! zeno-theme)
;; (package! zerodark-theme)
;; (package! gotham-theme)
;;
;; ;; fun
;; (package! gameoflife)
