(package! mips-mode)
(package! go-mode)
;; (package! deno-fmt)
(package! gameoflife)
(package! sudoku)
(package! plantuml-mode)
(package! agenix)

;; ai
(package! gpt-commit)
(package! gptel)
(package! tabnine)
